In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('attendance.csv')
df.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [5]:
grades = {
    'P': 1,
    'H': .5,
    'T': .9,
    'A': 0
}

(
    df.replace(grades)
    .rename(columns={'Unnamed: 0': 'student'})
    .melt(id_vars='student')
    .groupby('student')
    .value.mean()
)

student
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
Name: value, dtype: float64

In [6]:
df.replace(grades)\
    .rename(columns={'Unnamed: 0': 'student'})\
    .melt(id_vars='student')\
    .groupby('student')\
    .value.mean()

student
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
Name: value, dtype: float64

Cake

In [7]:
df = pd.read_csv('cake_recipes.csv')
df = df.melt(id_vars='recipe:position', var_name='temp', value_name='cake_score')
recipe_position = df['recipe:position'].str.split(':', expand=True)
recipe_position.columns = ['recipe', 'position']
df = pd.concat([df, recipe_position], axis=1).drop(columns='recipe:position')
df

   temp  cake_score recipe position
0   225   61.738655      a   bottom
1   225   51.709751      a      top
2   225   57.095320      b   bottom
3   225   82.455004      b      top
4   225   96.470207      c   bottom
5   225   71.306308      c      top
6   225   52.799753      d   bottom
7   225   96.873178      d      top
8   250   53.912627      a   bottom
9   250   52.009735      a      top
10  250   61.904369      b   bottom
11  250   95.224151      b      top
12  250   52.001358      c   bottom
13  250   82.795477      c      top
14  250   58.670419      d   bottom
15  250   76.101363      d      top
16  275   74.414730      a   bottom
17  275   68.576858      a      top
18  275   61.196980      b   bottom
19  275   98.594881      b      top
20  275   92.893227      c   bottom
21  275   92.098049      c      top
22  275   51.747686      d   bottom
23  275   59.571620      d      top
24  300   98.786784      a   bottom
25  300   50.228470      a      top
26  300   99.248541      b   bottom
27  300   58.169349      b      top
28  300   65.473084      c   bottom
29  300   53.960273      c      top
30  300   56.183110      d   bottom
31  300   50.971626      d      top

In [8]:
df.groupby('recipe').cake_score.mean()

recipe
a    63.922201
b    76.736074
c    75.874748
d    62.864844
Name: cake_score, dtype: float64

In [9]:
df.groupby('temp').mean()

      cake_score
temp
225    71.306022
250    66.577437
275    74.886754
300    66.627655

In [10]:
df.groupby('temp').cake_score.mean()

temp
225    71.306022
250    66.577437
275    74.886754
300    66.627655
Name: cake_score, dtype: float64